Project/GoalApp/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "AOt0qhKDgy2htMeJ5HU2hg"], ["updated_at", "2021-07-28 20:52:46.341917"], ["id", 1]]
---
    def create
        @user = User.create(user_params)

        if @user.save